# 🔢 אתגר חזקות גדולות! 🟰
#  🎯 המשימה:
# כתבו פונקציה last_digit_of_power(a, b) המקבלת שני מספרים חיוביים, a וb. ומחזירה את הספרה האחרונה של a בחזקת b.
# זה אולי נראה פשוט, אבל הפונקציה צריכה לעבוד גם על מספרים ממש גדולים, כאלה עם יותר מ-50 ספרות!
# ושם זה כבר נהיה מעניין...
#  📍 דוגמא:
# a = 2
# b = 4
# פלט: 6 (כי 2 בחזקת 4 זה 16, והספרה האחרונה של 16 היא 6)
# a = 9
# b = 7
# פלט: 9
# a = 3715290469715693021198967285016729344580685479654510946723
# b = 68819615221552997273737174557165657483427362207517952651
# פלט: 7
#
# 📢 פתרתם? שתפו את הקוד שלכם כאן! 💬💡
#  יאללה, תפעילו את המוח, ותתחילו לפתור! בהצלחה!

powers = {
    0: [0],
    1: [1],
    2: [2, 4, 8, 6],
    3: [3, 9, 7, 1],
    4: [4, 6],
    5: [5],
    6: [6],
    7: [7, 9, 3, 1],
    8: [8, 4, 2, 6],
    9: [9, 1],
}


def last_digit(n1, n2):
    if n2 == 0:
        return 1
    last_digit_of_base = n1 % 10
    cycle = len(powers[last_digit_of_base])
    return powers[last_digit_of_base][(n2 % cycle) - 1]


print(last_digit(4, 1))  # 4
print(last_digit(4, 2))  # 6
print(last_digit(9, 7))  # 9
print(last_digit(10, 10 ** 10))  # 0
print(last_digit(2 ** 200, 2 ** 300))  # 6
print(last_digit(3715290469715693021198967285016729344580685479654510946723, 68819615221552997273737174557165657483427362207517952651))
# 7

