package solutions;

public class Week6 {
//    🍋 אתגר מחיר הלימונים! 🍋
//    אתם מוכרים לימונים בשוק. כדי למכור אותם, אתם קודם מסדר אותם בקופסאות. בכל קופסה יש בדיוק 3 לימונים.
//    מחיר הקופסה נקבע לפי הלימון האמצעי. כלומר, השני הכי כבד מבין שלושת הלימונים שבה.
//            למשל: קופסה עם לימונים במשקלים [1, 2, 3] תימכר במחיר 2.
//            🎯 המשימה:
//    כתבו פונקציה maxLemonPrice(int[] lemons) שמקבלת מערך עם משקלי הלימונים, ומחזירה את המחיר הגבוה ביותר שניתן להשיג אם מסדרים את הלימונים לקבוצות של 3 לפי הכללים.
//            ⚠ חוקים מיוחדים:
//            🔢 כל קופסה חייבת להכיל בדיוק 3 לימונים.
//❌ אם אי אפשר לחלק את הלימונים כך, הפונקציה תחזיר -1.
//            📍 דוגמאות:
//    בתמונה המצורפת תוכלו לראות דוגמאות לפלט שהפונקציה צריכה להחזיר עבור קלטים שונים. מומלץ לבדוק את הפתרון שלכם בעזרתם!
//            📢 פתרתם? שתפו את הקוד שלכם כאן! 💬💡
//    יאללה, תוציאו מחשב ותתחילו לפתור!
//
//    ותמיד תזכרו:
//    When life gives you lemons, make lemonade, and give me some😋


    public static int maxLemonPrice(int[] lemons) {
        if (lemons.length % 3 != 0)
            return -1;

        int sum = 0;
        Arrays.sort(lemons);
        for (int i = lemons.length - 2; i > (lemons.length / 3) - 1; i -= 2)
            sum += lemons[i];

        return sum;
    }

    public static void main(String[] args) {
        int[] a = {96, 104, 104, 104, 96, 104, 100, 100, 96, 97, 98, 98};
        maxLemonPrice(a); // 406
        int[] b = {1, 2, 3, 4, 5, 6};
        maxLemonPrice(b); // 8
        int[] c = {100, 200, 200};
        maxLemonPrice(c); // 200
        int[] d = {6, 11, 9, 12, 12};
        maxLemonPrice(d); // -1
    }
}