public class Week5 {
//    ⌚ אתגר שעון קריא! ⏰
//    אתם באמצע של מבצע מסוכן, ועליכם לנטרל פצצה לפני שהיא תתפוצץ! הבעיה היא שהפצצה מציגה את הזמן עד לפיצוץ בשניות בלבד – לא בדיוק קריא במיוחד. לכן, אתם צרכים להפוך את התצוגה לברורה יותר!
//            🎯 המשימה:
//    כתבו פונקציה
//    makeReadable(int seconds)
//    שתקבל כמות שניות, ותהפוך אותו ליותר קריא בסגנון של: HH:MM:SS
//            • HH -> (שעות (מקסימום 99
//            • MM -> (דקות (מקסימום 59
//            • SS -> (שניות (מקסימום 59
//            📌 חוקים מיוחדים:
//            ⿠ אם המספר הוא ספרה אחת – צריך להוסיף אפס לפניו.
//            🔊 הקלט המקסימלי הוא 359999.
//            🎲בונוס: תגרמו לפונקציה לעבוד לכל כמות שניות! פשוט תמשיכו להוסיף שעות ללא הגבלה.
//            📍 דוגמאות:
//            בתמונה המצורפת תוכלו לראות דוגמאות לפלט שהפונקציה צריכה להחזיר עבור קלטים שונים. מומלץ לבדוק את הפתרון שלכם בעזרתם!
//            📢 פתרתם? שתפו את הקוד שלכם כאן! 💬💡
//            יאללה, תסתכלו מה השעה, תפתחו מחשב, ותתחילו לתכנת!🔥


    public static String makeReadable(int seconds) {
        int hours = seconds / 3600;
        seconds -= 3600 * hours;
        int minutes = seconds / 60;
        seconds -= 60 * minutes;
        return String.format("%02d", hours) + ":" + String.format("%02d", minutes) + ":" + String.format("%02d", seconds);
    }

    public static void main(String[] args) {
        makeReadable(359999);
        // 99:59:59
        makeReadable(5);
        // 00:00:05
        makeReadable(61);
        // 00:01:01

        // bonus
        makeReadable(360061);
        // 100:01:01
        makeReadable(360000);
        // 100:00:00
    }
}